app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
 LIMIT 1
---
    public function prosesLogin()
    {
        $email    = $this->request->getPost('email');
        $password = md5((string) $this->request->getPost('password'));

        $user = $this->userModel
            ->where('email', $email)
            ->where('password', $password)
            ->first();