app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `lowongan`
SELECT COUNT(*) AS `numrows` FROM `lamaran`
SELECT COUNT(*) AS `numrows`
FROM `lamaran`
WHERE `status_lamaran` = 'diterima'
SELECT COUNT(*) AS `numrows`
FROM `lowongan`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `lowongan`
WHERE `status` = 'expired'
---
    public function index()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        // Auto-expire jobs whose end_date has passed
        $db->query("UPDATE lowongan SET status='expired' WHERE end_date IS NOT NULL AND end_date < CURDATE() AND status = 'active'");

        $total_lowongan = $this->lowonganModel->countAll();
        $total_pelamar  = $this->lamaranModel->countAll();

        $total_hired = $this->lamaranModel
            ->where('status_lamaran', 'diterima')
            ->countAllResults();

        $open_jobs      = $this->lowonganModel->where('status', 'active')->countAllResults();
        $expired_jobs   = $this->lowonganModel->where('status', 'expired')->countAllResults();

SELECT `l`.`id`, `l`.`nama_pekerjaan`, `l`.`start_date`, `l`.`end_date`, `l`.`status`, COUNT(lm.id_lamaran) as total_applicants
FROM `lowongan` `l`
LEFT JOIN `lamaran` `lm` ON `lm`.`id_lowongan` = `l`.`id`
WHERE `l`.`status` IN ('active','draft')
GROUP BY `l`.`id`
ORDER BY `l`.`end_date` ASC
---
            ->get()->getResultArray();

        // Active/draft jobs with duration, days remaining, applicant count
        $job_postings = $db->table('lowongan l')
            ->select('l.id, l.nama_pekerjaan, l.start_date, l.end_date, l.status, COUNT(lm.id_lamaran) as total_applicants')
            ->join('lamaran lm', 'lm.id_lowongan = l.id', 'left')
            ->whereIn('l.status', ['active', 'draft'])
            ->groupBy('l.id')
            ->orderBy('l.end_date', 'ASC')
            ->get()->getResultArray();