app/Controllers/Lamaran.php

    public function form($id)
    {
        if (session()->get('role') !== 'pelamar') {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $lowongan = $db->table('lowongan')->where('id', $id)->get()->getRowArray();

        if (! $lowongan) {
            return redirect()->to('/pelamar/dashboard');
        }

        $kriteria = $db->table('kriteria')
            ->where('id_lowongan', $id)
            ->get()->getResultArray();

        $sub = [];
        foreach ($kriteria as $k) {
            $sub[$k['id_kriteria']] = $db->table('sub_kriteria')
                ->where('id_kriteria', $k['id_kriteria'])
                ->get()->getResultArray();
        }

        $pelamar = $db->table('pelamar')
            ->where('id_user', session()->get('id_user'))
            ->get()->getRowArray();
---
SELECT *
FROM `lowongan`
WHERE `id` = '14'
SELECT *
FROM `kriteria`
WHERE `id_lowongan` = '14'
SELECT *
FROM `sub_kriteria`
WHERE `id_kriteria` = '62'
SELECT *
FROM `pelamar`
WHERE `id_user` = '13'

    public function simpan()
    {
        if (session()->get('role') !== 'pelamar') {
            return redirect()->to('/login');
        }

        $validation = Services::validation();
        $db         = \Config\Database::connect();

        $pelamar = $db->table('pelamar')
            ->where('id_user', session()->get('id_user'))
            ->get()->getRowArray();
---
SELECT *
FROM `pelamar`
WHERE `id_user` = '30'

        $pendidikan = trim((string) $this->request->getPost('pendidikan'));

        // UPDATE DATA PELAMAR
        $db->table('pelamar')
        ->where('id_pelamar', $pelamar['id_pelamar'])
        ->update([

            'nama_lengkap'  => trim((string) $this->request->getPost('nama_lengkap')),
            'no_hp'         => trim((string) $this->request->getPost('no_hp')),
            'tempat_lahir'  => trim((string) $this->request->getPost('tempat_lahir')),
            'tanggal_lahir' => $this->request->getPost('tanggal_lahir'),
            'jenis_kelamin' => trim((string) $this->request->getPost('jenis_kelamin')),
            'pendidikan'    => $pendidikan,

        ]);

        // CEK SUDAH MELAMAR ATAU BELUM
        $existing = $db->table('lamaran')
            ->where('id_pelamar', $pelamar['id_pelamar'])
            ->where('id_lowongan', $idLowongan)
            ->get()->getRowArray();
---
UPDATE `pelamar` SET `nama_lengkap` = 'A satu', `no_hp` = '089778767888', `tempat_lahir` = 'Banjar', `tanggal_lahir` = '2026-06-04', `jenis_kelamin` = 'Laki-laki', `pendidikan` = 'd3'
WHERE `id_pelamar` = '33'
SELECT *
FROM `lamaran`
WHERE `id_pelamar` = '33'
AND `id_lowongan` = 18

        }

        // VALIDASI KRITERIA
        $kriteria = $db->table('kriteria')
            ->where('id_lowongan', $idLowongan)
            ->get()->getResultArray();
---
SELECT *
FROM `kriteria`
WHERE `id_lowongan` = 18

        }

        // INSERT LAMARAN
        $db->table('lamaran')
            ->insert($lamaranData);
---
INSERT INTO `lamaran` (`id_pelamar`, `id_lowongan`, `tanggal`, `status`, `status_lamaran`, `cv_filename`, `cv_path`, `cv_uploaded_at`, `surat_lamaran_filename`, `surat_lamaran_path`, `surat_lamaran_uploaded_at`, `ijazah_filename`, `ijazah_path`, `ijazah_uploaded_at`) VALUES ('33', 18, '2026-06-26', 'pending', 'pending', 'new dfd.pdf', 'uploads/cv/1782438238_f218d37d3dc17912f890.pdf', '2026-06-26 01:43:59', 'new dfd.pdf', 'uploads/surat_lamaran/1782438239_40ac6936f8a4da98ff66.pdf', '2026-06-26 01:43:59', 'new dfd.pdf', 'uploads/ijazah/1782438239_f84f0309b93d846d2892.pdf', '2026-06-26 01:43:59')

        }

        // RIWAYAT TAHAPAN
        $db->table('tahapan_rekrutmen')->insert([
            'id_lamaran' => $idLamaran,
            'tahapan'    => $status,
            'catatan'    => 'Lamaran berhasil dikirim',
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `tahapan_rekrutmen` (`id_lamaran`, `tahapan`, `catatan`, `created_at`) VALUES (39, 'pending', 'Lamaran berhasil dikirim', '2026-06-26 01:43:59')

    public function status()
    {
        if (session()->get('role') !== 'pelamar') {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $pelamar = $db->table('pelamar')
            ->where('id_user', session()->get('id_user'))
            ->get()->getRowArray();

        $lamaran = [];
        if ($pelamar) {
            $lamaran = $db->table('lamaran l')
                ->select('l.*, low.nama_pekerjaan, low.deskripsi')
                ->join('lowongan low', 'low.id = l.id_lowongan')
                ->where('l.id_pelamar', $pelamar['id_pelamar'])
                ->orderBy('l.id_lamaran', 'DESC')
                ->get()->getResultArray();
---
SELECT *
FROM `pelamar`
WHERE `id_user` = '22'
SELECT `l`.*, `low`.`nama_pekerjaan`, `low`.`deskripsi`
FROM `lamaran` `l`
JOIN `lowongan` `low` ON `low`.`id` = `l`.`id_lowongan`
WHERE `l`.`id_pelamar` = '25'
ORDER BY `l`.`id_lamaran` DESC