app/Controllers/Lowongan.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Auto-expire jobs whose end_date has passed
        $db->query("UPDATE lowongan SET status='expired' WHERE end_date IS NOT NULL AND end_date < CURDATE() AND status = 'active'");

        $filter  = $this->request->getGet('status');
        $builder = $this->lowonganModel->orderBy('id', 'DESC');
        if ($filter && in_array($filter, ['draft', 'active', 'expired'])) {
            $builder->where('status', $filter);
        }
        $lowongan = $builder->findAll();

        $counts = [
            'all'     => $this->lowonganModel->countAll(),
            'draft'   => $this->lowonganModel->where('status', 'draft')->countAllResults(),
            'active'  => $this->lowonganModel->where('status', 'active')->countAllResults(),
            'expired' => $this->lowonganModel->where('status', 'expired')->countAllResults(),
---
SELECT *
FROM `lowongan`
ORDER BY `id` DESC
SELECT COUNT(*) AS `numrows`
FROM `lowongan`
WHERE `status` = 'draft'
SELECT COUNT(*) AS `numrows`
FROM `lowongan`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `lowongan`
WHERE `status` = 'expired'

    public function simpanBasic()
    {
        $start  = $this->request->getPost('start_date') ?: null;
        $end    = $this->request->getPost('end_date')   ?: null;
        $status = $this->request->getPost('status')     ?: 'draft';
        $today  = date('Y-m-d');

        // Auto-compute status from dates if not explicitly set to draft
        if ($status !== 'draft' && $start && $end) {
            if ($today < $start)      $status = 'draft';
            elseif ($today > $end)    $status = 'expired';
            else                      $status = 'active';
        }

        $this->lowonganModel->save([
            'nama_pekerjaan' => $this->request->getPost('nama_pekerjaan'),
            'deskripsi'      => $this->request->getPost('deskripsi'),
            'start_date'     => $start,
            'end_date'       => $end,
            'status'         => $status,
        ]);
---
INSERT INTO `lowongan` (`nama_pekerjaan`, `deskripsi`, `start_date`, `end_date`, `status`) VALUES ('try', '', NULL, NULL, 'draft')

    public function edit($id)
    {
        $db       = \Config\Database::connect();
        $lowongan = $this->lowonganModel->find($id);

        $kriteria = $db->table('kriteria')->where('id_lowongan', $id)->get()->getResultArray();
        foreach ($kriteria as &$k) {
            $k['sub'] = $db->table('sub_kriteria')->where('id_kriteria', $k['id_kriteria'])->get()->getResultArray();
---
SELECT *
FROM `lowongan`
WHERE `lowongan`.`id` = '14'
SELECT *
FROM `kriteria`
WHERE `id_lowongan` = '14'
SELECT *
FROM `sub_kriteria`
WHERE `id_kriteria` = '62'