app/Controllers/PelamarProfile.php

    public function index()
    {
        $id = session()->get('id_user');

        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '34'

    public function update()
    {
        $id = session()->get('id_user');

        $user = $this->userModel->find($id);

        $foto = $this->request->getFile('foto');

        $namaFoto = $user['foto'];

        // UPLOAD FOTO
        if ($foto && $foto->isValid() && !$foto->hasMoved()) {

            $namaFoto = $foto->getRandomName();

            $foto->move('uploads/profile', $namaFoto);

            // HAPUS FOTO LAMA
            if (
                !empty($user['foto']) &&
                file_exists('uploads/profile/' . $user['foto'])
            ) {
                unlink('uploads/profile/' . $user['foto']);
            }
        }

        // UPDATE DATABASE
        $this->userModel->update($id, [
            'nama'   => $this->request->getPost('nama'),
            'email'  => $this->request->getPost('email'),
            'no_hp'  => $this->request->getPost('no_hp'),
            'alamat' => $this->request->getPost('alamat'),
            'foto'   => $namaFoto
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '34'
UPDATE `users` SET `nama` = 'cobaaaa', `email` = 'pw@gmail.com', `no_hp` = NULL, `alamat` = NULL, `foto` = '1782443607_3afa9bfa087fdc1b8910.png'
WHERE `users`.`id_user` IN ('34')