app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id_user` = '1'
---
    public function index()
    {
        $user = $this->userModel
            ->find(session()->get('id_user'));

SELECT *
FROM `users`
WHERE `users`.`id_user` = '30'
---
    public function changePassword()
    {
        $id = session()->get('id_user');

        $user = $this->userModel->find($id);